{"class_name": "Model", "config": {"name": "model_1", "output_layers": [["conv2d_5", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 33, 33, 1], "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_size": [9, 9], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "padding": "same", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "name": "conv2d_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "padding": "same", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "name": "conv2d_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "padding": "same", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "name": "conv2d_3", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "padding": "same", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "name": "conv2d_4", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "filters": 1, "padding": "same", "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "name": "conv2d_5", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.0.5"}